kbecker0619/StateMachineEngine/components/cwsw_arch_prj/cwsw_arch/MPC57xx/include/MPC5748G_defines_3.h
/** @file MPC5748G_defines_3.h
 *	@brief	One-sentence short description of file.
 *
 *	Description:
 *
 *	Copyright (c) 2018 Kevin L. Becker. All rights reserved.
 *
 *	Original:
 *	Created on: Feb 10, 2018
 *	Author: kbecker
 *
 *	Current:
 *	$Revision: $
 *	$Date: $
 */

#ifndef CWSW_ARCH_MPC57XX_INCLUDE_MPC5748G_DEFINES_3_H_
#define CWSW_ARCH_MPC57XX_INCLUDE_MPC5748G_DEFINES_3_H_

#ifdef	__cplusplus
extern "C" {
#endif

// ============================================================================
// ----	Include Files ---------------------------------------------------------
// ============================================================================

// ----	System Headers --------------------------

// ----	Project Headers -------------------------

// ----	Module Headers --------------------------


// ============================================================================
// ----	Constants -------------------------------------------------------------
// ============================================================================
#define CWSW_ARCH_MPC57XX_INCLUDE_MPC5748G_DEFINES_3_H__REVSTRING "$Revision: 0123 $"

/* CMP */
#define CMP_0_C0             CMP_0.C0.R                    /* CMP Control Register 0 */
#define CMP_0_C1             CMP_0.C1.R                    /* CMP Control Register 1 */
#define CMP_0_C2             CMP_0.C2.R                    /* CMP Control Register 2 */

/* CMP */
#define CMP_1_C0             CMP_1.C0.R                    /* CMP Control Register 0 */
#define CMP_1_C1             CMP_1.C1.R                    /* CMP Control Register 1 */
#define CMP_1_C2             CMP_1.C2.R                    /* CMP Control Register 2 */

/* CMP */
#define CMP_2_C0             CMP_2.C0.R                    /* CMP Control Register 0 */
#define CMP_2_C1             CMP_2.C1.R                    /* CMP Control Register 1 */
#define CMP_2_C2             CMP_2.C2.R                    /* CMP Control Register 2 */

/* CMU */
#define CMU_CSR              CMU.CSR.R                     /* CMU Control Status Register */
#define CMU_FDR              CMU.FDR.R                     /* CMU Frequency Display Register */
#define CMU_HFREFR           CMU.HFREFR.R                  /* CMU High Frequency Reference Register CLKMN1 */
#define CMU_LFREFR           CMU.LFREFR.R                  /* CMU Low Frequency Reference Register CLKMN1 */
#define CMU_ISR              CMU.ISR.R                     /* CMU Interrupt Status Register */
#define CMU_MDR              CMU.MDR.R                     /* CMU Measurement Duration Register */

/* CRC */
#define CRC_CFG              CRC.CFG.R                     /* Configuration Register */
#define CRC_INP              CRC.INP.R                     /* Input Register */
#define CRC_CSTAT            CRC.CSTAT.R                   /* Current Status Register */
#define CRC_OUTP             CRC.OUTP.R                    /* Output Register */

/* EDMA */
#define DMA_CR               EDMA.CR.R                      /* Control Register */
#define DMA_ES               EDMA.ES.R                      /* Error Status Register */
#define DMA_ERQ              EDMA.ERQ.R                     /* Enable Request Register */
#define DMA_EEI              EDMA.EEI.R                     /* Enable Error Interrupt Register */
#define DMA_SERQ             EDMA.SERQ.R                    /* Set Enable Request Register */
#define DMA_CERQ             EDMA.CERQ.R                    /* Clear Enable Request Register */
#define DMA_SEEI             EDMA.SEEI.R                    /* Set Enable Error Interrupt Register */
#define DMA_CEEI             EDMA.CEEI.R                    /* Clear Enable Error Interrupt Register */
#define DMA_CINT             EDMA.CINT.R                    /* Clear Interrupt Request Register */
#define DMA_CERR             EDMA.CERR.R                    /* Clear Error Register */
#define DMA_SSRT             EDMA.SSRT.R                    /* Set START Bit Register */
#define DMA_CDNE             EDMA.CDNE.R                    /* Clear DONE Status Bit Register */
#define DMA_INT              EDMA.INT.R                     /* Interrupt Request Register */
#define DMA_ERR              EDMA.ERR.R                     /* Error Register */
#define DMA_HRS              EDMA.HRS.R                     /* Hardware Request Status Register */
#define DMA_DCHPRI0          EDMA.DCHPRI[0].R               /* Channel n Priority Register */
#define DMA_DCHPRI1          EDMA.DCHPRI[1].R               /* Channel n Priority Register */
#define DMA_DCHPRI2          EDMA.DCHPRI[2].R               /* Channel n Priority Register */
#define DMA_DCHPRI3          EDMA.DCHPRI[3].R               /* Channel n Priority Register */
#define DMA_DCHPRI4          EDMA.DCHPRI[4].R               /* Channel n Priority Register */
#define DMA_DCHPRI5          EDMA.DCHPRI[5].R               /* Channel n Priority Register */
#define DMA_DCHPRI6          EDMA.DCHPRI[6].R               /* Channel n Priority Register */
#define DMA_DCHPRI7          EDMA.DCHPRI[7].R               /* Channel n Priority Register */
#define DMA_DCHPRI8          EDMA.DCHPRI[8].R               /* Channel n Priority Register */
#define DMA_DCHPRI9          EDMA.DCHPRI[9].R               /* Channel n Priority Register */
#define DMA_DCHPRI10         EDMA.DCHPRI[10].R              /* Channel n Priority Register */
#define DMA_DCHPRI11         EDMA.DCHPRI[11].R              /* Channel n Priority Register */
#define DMA_DCHPRI12         EDMA.DCHPRI[12].R              /* Channel n Priority Register */
#define DMA_DCHPRI13         EDMA.DCHPRI[13].R              /* Channel n Priority Register */
#define DMA_DCHPRI14         EDMA.DCHPRI[14].R              /* Channel n Priority Register */
#define DMA_DCHPRI15         EDMA.DCHPRI[15].R              /* Channel n Priority Register */
#define DMA_DCHPRI16         EDMA.DCHPRI[16].R              /* Channel n Priority Register */
#define DMA_DCHPRI17         EDMA.DCHPRI[17].R              /* Channel n Priority Register */
#define DMA_DCHPRI18         EDMA.DCHPRI[18].R              /* Channel n Priority Register */
#define DMA_DCHPRI19         EDMA.DCHPRI[19].R              /* Channel n Priority Register */
#define DMA_DCHPRI20         EDMA.DCHPRI[20].R              /* Channel n Priority Register */
#define DMA_DCHPRI21         EDMA.DCHPRI[21].R              /* Channel n Priority Register */
#define DMA_DCHPRI22         EDMA.DCHPRI[22].R              /* Channel n Priority Register */
#define DMA_DCHPRI23         EDMA.DCHPRI[23].R              /* Channel n Priority Register */
#define DMA_DCHPRI24         EDMA.DCHPRI[24].R              /* Channel n Priority Register */
#define DMA_DCHPRI25         EDMA.DCHPRI[25].R              /* Channel n Priority Register */
#define DMA_DCHPRI26         EDMA.DCHPRI[26].R              /* Channel n Priority Register */
#define DMA_DCHPRI27         EDMA.DCHPRI[27].R              /* Channel n Priority Register */
#define DMA_DCHPRI28         EDMA.DCHPRI[28].R              /* Channel n Priority Register */
#define DMA_DCHPRI29         EDMA.DCHPRI[29].R              /* Channel n Priority Register */
#define DMA_DCHPRI30         EDMA.DCHPRI[30].R              /* Channel n Priority Register */
#define DMA_DCHPRI31         EDMA.DCHPRI[31].R              /* Channel n Priority Register */
#define DMA_DCHMID0          EDMA.DCHMID[0].R               /* Channel n Master ID Register */
#define DMA_DCHMID1          EDMA.DCHMID[1].R               /* Channel n Master ID Register */
#define DMA_DCHMID2          EDMA.DCHMID[2].R               /* Channel n Master ID Register */
#define DMA_DCHMID3          EDMA.DCHMID[3].R               /* Channel n Master ID Register */
#define DMA_DCHMID4          EDMA.DCHMID[4].R               /* Channel n Master ID Register */
#define DMA_DCHMID5          EDMA.DCHMID[5].R               /* Channel n Master ID Register */
#define DMA_DCHMID6          EDMA.DCHMID[6].R               /* Channel n Master ID Register */
#define DMA_DCHMID7          EDMA.DCHMID[7].R               /* Channel n Master ID Register */
#define DMA_DCHMID8          EDMA.DCHMID[8].R               /* Channel n Master ID Register */
#define DMA_DCHMID9          EDMA.DCHMID[9].R               /* Channel n Master ID Register */
#define DMA_DCHMID10         EDMA.DCHMID[10].R              /* Channel n Master ID Register */
#define DMA_DCHMID11         EDMA.DCHMID[11].R              /* Channel n Master ID Register */
#define DMA_DCHMID12         EDMA.DCHMID[12].R              /* Channel n Master ID Register */
#define DMA_DCHMID13         EDMA.DCHMID[13].R              /* Channel n Master ID Register */
#define DMA_DCHMID14         EDMA.DCHMID[14].R              /* Channel n Master ID Register */
#define DMA_DCHMID15         EDMA.DCHMID[15].R              /* Channel n Master ID Register */
#define DMA_DCHMID16         EDMA.DCHMID[16].R              /* Channel n Master ID Register */
#define DMA_DCHMID17         EDMA.DCHMID[17].R              /* Channel n Master ID Register */
#define DMA_DCHMID18         EDMA.DCHMID[18].R              /* Channel n Master ID Register */
#define DMA_DCHMID19         EDMA.DCHMID[19].R              /* Channel n Master ID Register */
#define DMA_DCHMID20         EDMA.DCHMID[20].R              /* Channel n Master ID Register */
#define DMA_DCHMID21         EDMA.DCHMID[21].R              /* Channel n Master ID Register */
#define DMA_DCHMID22         EDMA.DCHMID[22].R              /* Channel n Master ID Register */
#define DMA_DCHMID23         EDMA.DCHMID[23].R              /* Channel n Master ID Register */
#define DMA_DCHMID24         EDMA.DCHMID[24].R              /* Channel n Master ID Register */
#define DMA_DCHMID25         EDMA.DCHMID[25].R              /* Channel n Master ID Register */
#define DMA_DCHMID26         EDMA.DCHMID[26].R              /* Channel n Master ID Register */
#define DMA_DCHMID27         EDMA.DCHMID[27].R              /* Channel n Master ID Register */
#define DMA_DCHMID28         EDMA.DCHMID[28].R              /* Channel n Master ID Register */
#define DMA_DCHMID29         EDMA.DCHMID[29].R              /* Channel n Master ID Register */
#define DMA_DCHMID30         EDMA.DCHMID[30].R              /* Channel n Master ID Register */
#define DMA_DCHMID31         EDMA.DCHMID[31].R              /* Channel n Master ID Register */
#define DMA_TCD0_SADDR       EDMA.TCD[0].SADDR.R            /* TCD Source Address */
#define DMA_TCD0_ATTR        EDMA.TCD[0].ATTR.R             /* TCD Transfer Attributes */
#define DMA_TCD0_SOFF        EDMA.TCD[0].SOFF.R             /* TCD Signed Source Address Offset */
#define DMA_TCD0_NBYTES_MLNO EDMA.TCD[0].NBYTES.MLNO.R      /* TCD Minor Byte Count (Minor Loop Disabled) */
#define DMA_TCD0_NBYTES_MLOFFNO EDMA.TCD[0].NBYTES.MLOFFNO.R /* TCD Signed Minor Loop Offset (Minor Loop Enabled and Offset Disabled) */
#define DMA_TCD0_NBYTES_MLOFFYES EDMA.TCD[0].NBYTES.MLOFFYES.R /* TCD Signed Minor Loop Offset (Minor Loop and Offset Enabled) */
#define DMA_TCD0_SLAST       EDMA.TCD[0].SLAST.R            /* TCD Last Source Address Adjustment */
#define DMA_TCD0_DADDR       EDMA.TCD[0].DADDR.R            /* TCD Destination Address */
#define DMA_TCD0_CITER_ELINKNO EDMA.TCD[0].CITER.ELINKNO.R  /* TCD Current Minor Loop Link, Major Loop Count (Channel Linking Disabled) */
#define DMA_TCD0_CITER_ELINKYES EDMA.TCD[0].CITER.ELINKYES.R /* TCD Current Minor Loop Link, Major Loop Count (Channel Linking Enabled) */
#define DMA_TCD0_DOFF        EDMA.TCD[0].DOFF.R             /* TCD Signed Destination Address Offset */
#define DMA_TCD0_DLASTSGA    EDMA.TCD[0].DLASTSGA.R         /* TCD Last Destination Address Adjustment/Scatter Gather Address */
#define DMA_TCD0_BITER_ELINKNO EDMA.TCD[0].BITER.ELINKNO.R  /* TCD Beginning Minor Loop Link, Major Loop Count (Channel Linking Disabled) */
#define DMA_TCD0_BITER_ELINKYES EDMA.TCD[0].BITER.ELINKYES.R /* TCD Beginning Minor Loop Link, Major Loop Count (Channel Linking Enabled) */
#define DMA_TCD0_CSR         EDMA.TCD[0].CSR.R              /* TCD Control and Status */
#define DMA_TCD1_SADDR       EDMA.TCD[1].SADDR.R            /* TCD Source Address */
#define DMA_TCD1_ATTR        EDMA.TCD[1].ATTR.R             /* TCD Transfer Attributes */
#define DMA_TCD1_SOFF        EDMA.TCD[1].SOFF.R             /* TCD Signed Source Address Offset */
#define DMA_TCD1_NBYTES_MLNO EDMA.TCD[1].NBYTES.MLNO.R      /* TCD Minor Byte Count (Minor Loop Disabled) */
#define DMA_TCD1_NBYTES_MLOFFNO EDMA.TCD[1].NBYTES.MLOFFNO.R /* TCD Signed Minor Loop Offset (Minor Loop Enabled and Offset Disabled) */
#define DMA_TCD1_NBYTES_MLOFFYES EDMA.TCD[1].NBYTES.MLOFFYES.R /* TCD Signed Minor Loop Offset (Minor Loop and Offset Enabled) */
#define DMA_TCD1_SLAST       EDMA.TCD[1].SLAST.R            /* TCD Last Source Address Adjustment */
#define DMA_TCD1_DADDR       EDMA.TCD[1].DADDR.R            /* TCD Destination Address */
#define DMA_TCD1_CITER_ELINKNO EDMA.TCD[1].CITER.ELINKNO.R  /* TCD Current Minor Loop Link, Major Loop Count (Channel Linking Disabled) */
#define DMA_TCD1_CITER_ELINKYES EDMA.TCD[1].CITER.ELINKYES.R /* TCD Current Minor Loop Link, Major Loop Count (Channel Linking Enabled) */
#define DMA_TCD1_DOFF        EDMA.TCD[1].DOFF.R             /* TCD Signed Destination Address Offset */
#define DMA_TCD1_DLASTSGA    EDMA.TCD[1].DLASTSGA.R         /* TCD Last Destination Address Adjustment/Scatter Gather Address */
#define DMA_TCD1_BITER_ELINKNO EDMA.TCD[1].BITER.ELINKNO.R  /* TCD Beginning Minor Loop Link, Major Loop Count (Channel Linking Disabled) */
#define DMA_TCD1_BITER_ELINKYES EDMA.TCD[1].BITER.ELINKYES.R /* TCD Beginning Minor Loop Link, Major Loop Count (Channel Linking Enabled) */
#define DMA_TCD1_CSR         EDMA.TCD[1].CSR.R              /* TCD Control and Status */
#define DMA_TCD2_SADDR       EDMA.TCD[2].SADDR.R            /* TCD Source Address */
#define DMA_TCD2_ATTR        EDMA.TCD[2].ATTR.R             /* TCD Transfer Attributes */
#define DMA_TCD2_SOFF        EDMA.TCD[2].SOFF.R             /* TCD Signed Source Address Offset */
#define DMA_TCD2_NBYTES_MLNO EDMA.TCD[2].NBYTES.MLNO.R      /* TCD Minor Byte Count (Minor Loop Disabled) */
#define DMA_TCD2_NBYTES_MLOFFNO EDMA.TCD[2].NBYTES.MLOFFNO.R /* TCD Signed Minor Loop Offset (Minor Loop Enabled and Offset Disabled) */
#define DMA_TCD2_NBYTES_MLOFFYES EDMA.TCD[2].NBYTES.MLOFFYES.R /* TCD Signed Minor Loop Offset (Minor Loop and Offset Enabled) */
#define DMA_TCD2_SLAST       EDMA.TCD[2].SLAST.R            /* TCD Last Source Address Adjustment */
#define DMA_TCD2_DADDR       EDMA.TCD[2].DADDR.R            /* TCD Destination Address */
#define DMA_TCD2_CITER_ELINKNO EDMA.TCD[2].CITER.ELINKNO.R  /* TCD Current Minor Loop Link, Major Loop Count (Channel Linking Disabled) */
#define DMA_TCD2_CITER_ELINKYES EDMA.TCD[2].CITER.ELINKYES.R /* TCD Current Minor Loop Link, Major Loop Count (Channel Linking Enabled) */
#define DMA_TCD2_DOFF        EDMA.TCD[2].DOFF.R             /* TCD Signed Destination Address Offset */
#define DMA_TCD2_DLASTSGA    EDMA.TCD[2].DLASTSGA.R         /* TCD Last Destination Address Adjustment/Scatter Gather Address */
#define DMA_TCD2_BITER_ELINKNO EDMA.TCD[2].BITER.ELINKNO.R  /* TCD Beginning Minor Loop Link, Major Loop Count (Channel Linking Disabled) */
#define DMA_TCD2_BITER_ELINKYES EDMA.TCD[2].BITER.ELINKYES.R /* TCD Beginning Minor Loop Link, Major Loop Count (Channel Linking Enabled) */
#define DMA_TCD2_CSR         EDMA.TCD[2].CSR.R              /* TCD Control and Status */
#define DMA_TCD3_SADDR       EDMA.TCD[3].SADDR.R            /* TCD Source Address */
#define DMA_TCD3_ATTR        EDMA.TCD[3].ATTR.R             /* TCD Transfer Attributes */
#define DMA_TCD3_SOFF        EDMA.TCD[3].SOFF.R             /* TCD Signed Source Address Offset */
#define DMA_TCD3_NBYTES_MLNO EDMA.TCD[3].NBYTES.MLNO.R      /* TCD Minor Byte Count (Minor Loop Disabled) */
#define DMA_TCD3_NBYTES_MLOFFNO EDMA.TCD[3].NBYTES.MLOFFNO.R /* TCD Signed Minor Loop Offset (Minor Loop Enabled and Offset Disabled) */
#define DMA_TCD3_NBYTES_MLOFFYES EDMA.TCD[3].NBYTES.MLOFFYES.R /* TCD Signed Minor Loop Offset (Minor Loop and Offset Enabled) */
#define DMA_TCD3_SLAST       EDMA.TCD[3].SLAST.R            /* TCD Last Source Address Adjustment */
#define DMA_TCD3_DADDR       EDMA.TCD[3].DADDR.R            /* TCD Destination Address */
#define DMA_TCD3_CITER_ELINKNO EDMA.TCD[3].CITER.ELINKNO.R  /* TCD Current Minor Loop Link, Major Loop Count (Channel Linking Disabled) */
#define DMA_TCD3_CITER_ELINKYES EDMA.TCD[3].CITER.ELINKYES.R /* TCD Current Minor Loop Link, Major Loop Count (Channel Linking Enabled) */
#define DMA_TCD3_DOFF        EDMA.TCD[3].DOFF.R             /* TCD Signed Destination Address Offset */
#define DMA_TCD3_DLASTSGA    EDMA.TCD[3].DLASTSGA.R         /* TCD Last Destination Address Adjustment/Scatter Gather Address */
#define DMA_TCD3_BITER_ELINKNO EDMA.TCD[3].BITER.ELINKNO.R  /* TCD Beginning Minor Loop Link, Major Loop Count (Channel Linking Disabled) */
#define DMA_TCD3_BITER_ELINKYES EDMA.TCD[3].BITER.ELINKYES.R /* TCD Beginning Minor Loop Link, Major Loop Count (Channel Linking Enabled) */
#define DMA_TCD3_CSR         EDMA.TCD[3].CSR.R              /* TCD Control and Status */
#define DMA_TCD4_SADDR       EDMA.TCD[4].SADDR.R            /* TCD Source Address */
#define DMA_TCD4_ATTR        EDMA.TCD[4].ATTR.R             /* TCD Transfer Attributes */
#define DMA_TCD4_SOFF        EDMA.TCD[4].SOFF.R             /* TCD Signed Source Address Offset */
#define DMA_TCD4_NBYTES_MLNO EDMA.TCD[4].NBYTES.MLNO.R      /* TCD Minor Byte Count (Minor Loop Disabled) */
#define DMA_TCD4_NBYTES_MLOFFNO EDMA.TCD[4].NBYTES.MLOFFNO.R /* TCD Signed Minor Loop Offset (Minor Loop Enabled and Offset Disabled) */
#define DMA_TCD4_NBYTES_MLOFFYES EDMA.TCD[4].NBYTES.MLOFFYES.R /* TCD Signed Minor Loop Offset (Minor Loop and Offset Enabled) */
#define DMA_TCD4_SLAST       EDMA.TCD[4].SLAST.R            /* TCD Last Source Address Adjustment */
#define DMA_TCD4_DADDR       EDMA.TCD[4].DADDR.R            /* TCD Destination Address */
#define DMA_TCD4_CITER_ELINKNO EDMA.TCD[4].CITER.ELINKNO.R  /* TCD Current Minor Loop Link, Major Loop Count (Channel Linking Disabled) */
#define DMA_TCD4_CITER_ELINKYES EDMA.TCD[4].CITER.ELINKYES.R /* TCD Current Minor Loop Link, Major Loop Count (Channel Linking Enabled) */
#define DMA_TCD4_DOFF        EDMA.TCD[4].DOFF.R             /* TCD Signed Destination Address Offset */
#define DMA_TCD4_DLASTSGA    EDMA.TCD[4].DLASTSGA.R         /* TCD Last Destination Address Adjustment/Scatter Gather Address */
#define DMA_TCD4_BITER_ELINKNO EDMA.TCD[4].BITER.ELINKNO.R  /* TCD Beginning Minor Loop Link, Major Loop Count (Channel Linking Disabled) */
#define DMA_TCD4_BITER_ELINKYES EDMA.TCD[4].BITER.ELINKYES.R /* TCD Beginning Minor Loop Link, Major Loop Count (Channel Linking Enabled) */
#define DMA_TCD4_CSR         EDMA.TCD[4].CSR.R              /* TCD Control and Status */
#define DMA_TCD5_SADDR       EDMA.TCD[5].SADDR.R            /* TCD Source Address */
#define DMA_TCD5_ATTR        EDMA.TCD[5].ATTR.R             /* TCD Transfer Attributes */
#define DMA_TCD5_SOFF        EDMA.TCD[5].SOFF.R             /* TCD Signed Source Address Offset */
#define DMA_TCD5_NBYTES_MLNO EDMA.TCD[5].NBYTES.MLNO.R      /* TCD Minor Byte Count (Minor Loop Disabled) */
#define DMA_TCD5_NBYTES_MLOFFNO EDMA.TCD[5].NBYTES.MLOFFNO.R /* TCD Signed Minor Loop Offset (Minor Loop Enabled and Offset Disabled) */
#define DMA_TCD5_NBYTES_MLOFFYES EDMA.TCD[5].NBYTES.MLOFFYES.R /* TCD Signed Minor Loop Offset (Minor Loop and Offset Enabled) */
#define DMA_TCD5_SLAST       EDMA.TCD[5].SLAST.R            /* TCD Last Source Address Adjustment */
#define DMA_TCD5_DADDR       EDMA.TCD[5].DADDR.R            /* TCD Destination Address */
#define DMA_TCD5_CITER_ELINKNO EDMA.TCD[5].CITER.ELINKNO.R  /* TCD Current Minor Loop Link, Major Loop Count (Channel Linking Disabled) */
#define DMA_TCD5_CITER_ELINKYES EDMA.TCD[5].CITER.ELINKYES.R /* TCD Current Minor Loop Link, Major Loop Count (Channel Linking Enabled) */
#define DMA_TCD5_DOFF        EDMA.TCD[5].DOFF.R             /* TCD Signed Destination Address Offset */
#define DMA_TCD5_DLASTSGA    EDMA.TCD[5].DLASTSGA.R         /* TCD Last Destination Address Adjustment/Scatter Gather Address */
#define DMA_TCD5_BITER_ELINKNO EDMA.TCD[5].BITER.ELINKNO.R  /* TCD Beginning Minor Loop Link, Major Loop Count (Channel Linking Disabled) */
#define DMA_TCD5_BITER_ELINKYES EDMA.TCD[5].BITER.ELINKYES.R /* TCD Beginning Minor Loop Link, Major Loop Count (Channel Linking Enabled) */
#define DMA_TCD5_CSR         EDMA.TCD[5].CSR.R              /* TCD Control and Status */
#define DMA_TCD6_SADDR       EDMA.TCD[6].SADDR.R            /* TCD Source Address */
#define DMA_TCD6_ATTR        EDMA.TCD[6].ATTR.R             /* TCD Transfer Attributes */
#define DMA_TCD6_SOFF        EDMA.TCD[6].SOFF.R             /* TCD Signed Source Address Offset */
#define DMA_TCD6_NBYTES_MLNO EDMA.TCD[6].NBYTES.MLNO.R      /* TCD Minor Byte Count (Minor Loop Disabled) */
#define DMA_TCD6_NBYTES_MLOFFNO EDMA.TCD[6].NBYTES.MLOFFNO.R /* TCD Signed Minor Loop Offset (Minor Loop Enabled and Offset Disabled) */
#define DMA_TCD6_NBYTES_MLOFFYES EDMA.TCD[6].NBYTES.MLOFFYES.R /* TCD Signed Minor Loop Offset (Minor Loop and Offset Enabled) */
#define DMA_TCD6_SLAST       EDMA.TCD[6].SLAST.R            /* TCD Last Source Address Adjustment */
#define DMA_TCD6_DADDR       EDMA.TCD[6].DADDR.R            /* TCD Destination Address */
#define DMA_TCD6_CITER_ELINKNO EDMA.TCD[6].CITER.ELINKNO.R  /* TCD Current Minor Loop Link, Major Loop Count (Channel Linking Disabled) */
#define DMA_TCD6_CITER_ELINKYES EDMA.TCD[6].CITER.ELINKYES.R /* TCD Current Minor Loop Link, Major Loop Count (Channel Linking Enabled) */
#define DMA_TCD6_DOFF        EDMA.TCD[6].DOFF.R             /* TCD Signed Destination Address Offset */
#define DMA_TCD6_DLASTSGA    EDMA.TCD[6].DLASTSGA.R         /* TCD Last Destination Address Adjustment/Scatter Gather Address */
#define DMA_TCD6_BITER_ELINKNO EDMA.TCD[6].BITER.ELINKNO.R  /* TCD Beginning Minor Loop Link, Major Loop Count (Channel Linking Disabled) */
#define DMA_TCD6_BITER_ELINKYES EDMA.TCD[6].BITER.ELINKYES.R /* TCD Beginning Minor Loop Link, Major Loop Count (Channel Linking Enabled) */
#define DMA_TCD6_CSR         EDMA.TCD[6].CSR.R              /* TCD Control and Status */
#define DMA_TCD7_SADDR       EDMA.TCD[7].SADDR.R            /* TCD Source Address */
#define DMA_TCD7_ATTR        EDMA.TCD[7].ATTR.R             /* TCD Transfer Attributes */
#define DMA_TCD7_SOFF        EDMA.TCD[7].SOFF.R             /* TCD Signed Source Address Offset */
#define DMA_TCD7_NBYTES_MLNO EDMA.TCD[7].NBYTES.MLNO.R      /* TCD Minor Byte Count (Minor Loop Disabled) */
#define DMA_TCD7_NBYTES_MLOFFNO EDMA.TCD[7].NBYTES.MLOFFNO.R /* TCD Signed Minor Loop Offset (Minor Loop Enabled and Offset Disabled) */
#define DMA_TCD7_NBYTES_MLOFFYES EDMA.TCD[7].NBYTES.MLOFFYES.R /* TCD Signed Minor Loop Offset (Minor Loop and Offset Enabled) */
#define DMA_TCD7_SLAST       EDMA.TCD[7].SLAST.R            /* TCD Last Source Address Adjustment */
#define DMA_TCD7_DADDR       EDMA.TCD[7].DADDR.R            /* TCD Destination Address */
#define DMA_TCD7_CITER_ELINKNO EDMA.TCD[7].CITER.ELINKNO.R  /* TCD Current Minor Loop Link, Major Loop Count (Channel Linking Disabled) */
#define DMA_TCD7_CITER_ELINKYES EDMA.TCD[7].CITER.ELINKYES.R /* TCD Current Minor Loop Link, Major Loop Count (Channel Linking Enabled) */
#define DMA_TCD7_DOFF        EDMA.TCD[7].DOFF.R             /* TCD Signed Destination Address Offset */
#define DMA_TCD7_DLASTSGA    EDMA.TCD[7].DLASTSGA.R         /* TCD Last Destination Address Adjustment/Scatter Gather Address */
#define DMA_TCD7_BITER_ELINKNO EDMA.TCD[7].BITER.ELINKNO.R  /* TCD Beginning Minor Loop Link, Major Loop Count (Channel Linking Disabled) */
