kbecker0619/StateMachineEngine/components/cwsw_arch_prj/cwsw_arch/MPC57xx/include/MPC5748G_defines_3.h
/* MC_ME */
#define MC_ME_GS             MC_ME.GS.R                    /* Global Status Register */
#define MC_ME_MCTL           MC_ME.MCTL.R                  /* Mode Control Register */
#define MC_ME_ME             MC_ME.ME.R                    /* Mode Enable Register */
#define MC_ME_IS             MC_ME.IS.R                    /* Interrupt Status Register */
#define MC_ME_IM             MC_ME.IM.R                    /* Interrupt Mask Register */
#define MC_ME_IMTS           MC_ME.IMTS.R                  /* Invalid Mode Transition Status Register */
#define MC_ME_DMTS           MC_ME.DMTS.R                  /* Debug Mode Transition Status Register */
#define MC_ME_RESET_MC       MC_ME.RESET_MC.R              /* RESET Mode Configuration Register */
#define MC_ME_SAFE_MC        MC_ME.SAFE_MC.R               /* SAFE Mode Configuration Register */
#define MC_ME_DRUN_MC        MC_ME.DRUN_MC.R               /* DRUN Mode Configuration Register */
#define MC_ME_RUN0_MC        MC_ME.RUN_MC[0].R             /* RUN0 Mode Configuration Register */
#define MC_ME_RUN1_MC        MC_ME.RUN_MC[1].R             /* RUN1 Mode Configuration Register */
#define MC_ME_RUN2_MC        MC_ME.RUN_MC[2].R             /* RUN2 Mode Configuration Register */
#define MC_ME_RUN3_MC        MC_ME.RUN_MC[3].R             /* RUN3 Mode Configuration Register */
#define MC_ME_STOP_MC        MC_ME.STOP_MC.R               /* STOP0 Mode Configuration Register */
#define MC_ME_STANDBY_MC     MC_ME.STANDBY_MC.R            /* STANDBY0 Mode Configuration Register */
#define MC_ME_PS0            MC_ME.PS0.R                   /* Peripheral Status Register 0 */
#define MC_ME_PS1            MC_ME.PS1.R                   /* Peripheral Status Register 1 */
#define MC_ME_PS2            MC_ME.PS2.R                   /* Peripheral Status Register 2 */
#define MC_ME_PS3            MC_ME.PS3.R                   /* Peripheral Status Register 3 */
#define MC_ME_RUN_PC0        MC_ME.RUN_PC[0].R             /* Run Peripheral Configuration Register */
#define MC_ME_RUN_PC1        MC_ME.RUN_PC[1].R             /* Run Peripheral Configuration Register */
#define MC_ME_RUN_PC2        MC_ME.RUN_PC[2].R             /* Run Peripheral Configuration Register */
#define MC_ME_RUN_PC3        MC_ME.RUN_PC[3].R             /* Run Peripheral Configuration Register */
#define MC_ME_RUN_PC4        MC_ME.RUN_PC[4].R             /* Run Peripheral Configuration Register */
#define MC_ME_RUN_PC5        MC_ME.RUN_PC[5].R             /* Run Peripheral Configuration Register */
#define MC_ME_RUN_PC6        MC_ME.RUN_PC[6].R             /* Run Peripheral Configuration Register */
#define MC_ME_RUN_PC7        MC_ME.RUN_PC[7].R             /* Run Peripheral Configuration Register */
#define MC_ME_LP_PC0         MC_ME.LP_PC[0].R              /* Low-Power Peripheral Configuration Register */
#define MC_ME_LP_PC1         MC_ME.LP_PC[1].R              /* Low-Power Peripheral Configuration Register */
#define MC_ME_LP_PC2         MC_ME.LP_PC[2].R              /* Low-Power Peripheral Configuration Register */
#define MC_ME_LP_PC3         MC_ME.LP_PC[3].R              /* Low-Power Peripheral Configuration Register */
#define MC_ME_LP_PC4         MC_ME.LP_PC[4].R              /* Low-Power Peripheral Configuration Register */
#define MC_ME_LP_PC5         MC_ME.LP_PC[5].R              /* Low-Power Peripheral Configuration Register */
#define MC_ME_LP_PC6         MC_ME.LP_PC[6].R              /* Low-Power Peripheral Configuration Register */
#define MC_ME_LP_PC7         MC_ME.LP_PC[7].R              /* Low-Power Peripheral Configuration Register */
#define MC_ME_PCTL0          MC_ME.PCTL[0].R               /* BCTU Peripheral Control Register */
#define MC_ME_PCTL1          MC_ME.PCTL[1].R               /* eMIOS_0 Peripheral Control Register */
#define MC_ME_PCTL2          MC_ME.PCTL[2].R               /* eMIOS_1 Peripheral Control Register */
#define MC_ME_PCTL3          MC_ME.PCTL[3].R               /* eMIOS_2 Peripheral Control Register */
#define MC_ME_PCTL4          MC_ME.PCTL[4].R               /* USB OTG Peripheral Control register */
#define MC_ME_PCTL5          MC_ME.PCTL[5].R               /* USB_SPH Peripheral Control Register */
#define MC_ME_PCTL6          MC_ME.PCTL[6].R               /* MLB Peripheral Control Register */
#define MC_ME_PCTL7          MC_ME.PCTL[7].R               /* SDHC Peripheral Control Register */
#define MC_ME_PCTL8          MC_ME.PCTL[8].R               /*  */
#define MC_ME_PCTL9          MC_ME.PCTL[9].R               /*  */
#define MC_ME_PCTL10         MC_ME.PCTL[10].R              /* SAI0 Peripheral Control Register */
#define MC_ME_PCTL11         MC_ME.PCTL[11].R              /* SAI1 Peripheral Control Register */
#define MC_ME_PCTL12         MC_ME.PCTL[12].R              /* SAI2 Peripheral Control Register */
#define MC_ME_PCTL13         MC_ME.PCTL[13].R              /*  */
#define MC_ME_PCTL14         MC_ME.PCTL[14].R              /*  */
#define MC_ME_PCTL15         MC_ME.PCTL[15].R              /* ENET Peripheral Control Register */
#define MC_ME_PCTL16         MC_ME.PCTL[16].R              /*  */
#define MC_ME_PCTL17         MC_ME.PCTL[17].R              /*  */
#define MC_ME_PCTL18         MC_ME.PCTL[18].R              /*  */
#define MC_ME_PCTL19         MC_ME.PCTL[19].R              /*  */
#define MC_ME_PCTL20         MC_ME.PCTL[20].R              /* CMP_0 Peripheral Control Register */
#define MC_ME_PCTL21         MC_ME.PCTL[21].R              /* CMP_1 Peripheral Control Register */
#define MC_ME_PCTL22         MC_ME.PCTL[22].R              /* CMP_2 Peripheral Control Register */
#define MC_ME_PCTL23         MC_ME.PCTL[23].R              /*  */
#define MC_ME_PCTL24         MC_ME.PCTL[24].R              /* ADC_0 Peripheral Control Register */
#define MC_ME_PCTL25         MC_ME.PCTL[25].R              /* ADC_1 Peripheral Control Register */
#define MC_ME_PCTL26         MC_ME.PCTL[26].R              /*  */
#define MC_ME_PCTL27         MC_ME.PCTL[27].R              /*  */
#define MC_ME_PCTL28         MC_ME.PCTL[28].R              /* FlexRay Peripheral Control Register */
#define MC_ME_PCTL29         MC_ME.PCTL[29].R              /*  */
#define MC_ME_PCTL30         MC_ME.PCTL[30].R              /* IIC_0 Peripheral Control Register */
#define MC_ME_PCTL31         MC_ME.PCTL[31].R              /* IIC_1 Peripheral Control Register */
#define MC_ME_PCTL32         MC_ME.PCTL[32].R              /* IIC_2 Peripheral Control Register */
#define MC_ME_PCTL33         MC_ME.PCTL[33].R              /* IIC_3 Peripheral Control Register */
#define MC_ME_PCTL34         MC_ME.PCTL[34].R              /*  */
#define MC_ME_PCTL35         MC_ME.PCTL[35].R              /*  */
#define MC_ME_PCTL36         MC_ME.PCTL[36].R              /*  */
#define MC_ME_PCTL37         MC_ME.PCTL[37].R              /*  */
#define MC_ME_PCTL38         MC_ME.PCTL[38].R              /*  */
#define MC_ME_PCTL39         MC_ME.PCTL[39].R              /*  */
#define MC_ME_PCTL40         MC_ME.PCTL[40].R              /* DSPI_0 Peripheral Control Register */
#define MC_ME_PCTL41         MC_ME.PCTL[41].R              /* DSPI_1 Peripheral Control Register */
#define MC_ME_PCTL42         MC_ME.PCTL[42].R              /* DSPI_2 Peripheral Control Register */
#define MC_ME_PCTL43         MC_ME.PCTL[43].R              /* DSPI_3 Peripheral Control Register */
#define MC_ME_PCTL44         MC_ME.PCTL[44].R              /*  */
#define MC_ME_PCTL45         MC_ME.PCTL[45].R              /*  */
#define MC_ME_PCTL46         MC_ME.PCTL[46].R              /*  */
#define MC_ME_PCTL47         MC_ME.PCTL[47].R              /*  */
#define MC_ME_PCTL48         MC_ME.PCTL[48].R              /*  */
#define MC_ME_PCTL49         MC_ME.PCTL[49].R              /*  */
#define MC_ME_PCTL50         MC_ME.PCTL[50].R              /* LIN_0 Peripheral Control Register */
#define MC_ME_PCTL51         MC_ME.PCTL[51].R              /* LIN_1 Peripheral Control Register */
#define MC_ME_PCTL52         MC_ME.PCTL[52].R              /* LIN_2 Peripheral Control Register */
#define MC_ME_PCTL53         MC_ME.PCTL[53].R              /* LIN_3 Peripheral Control Register */
#define MC_ME_PCTL54         MC_ME.PCTL[54].R              /* LIN_4 Peripheral Control Register */
#define MC_ME_PCTL55         MC_ME.PCTL[55].R              /* LIN_5 Peripheral Control Register */
#define MC_ME_PCTL56         MC_ME.PCTL[56].R              /* LIN_6 Peripheral Control Register */
#define MC_ME_PCTL57         MC_ME.PCTL[57].R              /* LIN_7 Peripheral Control Register */
#define MC_ME_PCTL58         MC_ME.PCTL[58].R              /* LIN 8 Peripheral Control Register */
#define MC_ME_PCTL59         MC_ME.PCTL[59].R              /* LIN_9 Peripheral Control Register */
#define MC_ME_PCTL60         MC_ME.PCTL[60].R              /* LIN_10 Peripheral Control Register */
#define MC_ME_PCTL61         MC_ME.PCTL[61].R              /* LIN_11 Peripheral Control Register */
#define MC_ME_PCTL62         MC_ME.PCTL[62].R              /* LIN 12 Peripheral Control Register */
#define MC_ME_PCTL63         MC_ME.PCTL[63].R              /* LIN_13 Peripheral Control Register */
#define MC_ME_PCTL64         MC_ME.PCTL[64].R              /* LIN 14 Peripheral Control Register */
#define MC_ME_PCTL65         MC_ME.PCTL[65].R              /* LIN_15 Peripheral Control Register */
#define MC_ME_PCTL66         MC_ME.PCTL[66].R              /* LIN_16 Peripheral Control Register */
#define MC_ME_PCTL67         MC_ME.PCTL[67].R              /* LIN_17 Peripheral Control Register */
#define MC_ME_PCTL68         MC_ME.PCTL[68].R              /*  */
#define MC_ME_PCTL69         MC_ME.PCTL[69].R              /*  */
#define MC_ME_PCTL70         MC_ME.PCTL[70].R              /* FLEXCAN_0 Peripheral Control Register */
#define MC_ME_PCTL71         MC_ME.PCTL[71].R              /* FLEXCAN_1 Peripheral Control Register */
#define MC_ME_PCTL72         MC_ME.PCTL[72].R              /* FLEXCAN_2 Peripheral Control Register */
#define MC_ME_PCTL73         MC_ME.PCTL[73].R              /* FLEXCAN_3 Peripheral Control Register */
#define MC_ME_PCTL74         MC_ME.PCTL[74].R              /* FLEXCAN_4 Peripheral Control Register */
#define MC_ME_PCTL75         MC_ME.PCTL[75].R              /* FLEXCAN_5 Peripheral Control Register */
#define MC_ME_PCTL76         MC_ME.PCTL[76].R              /* FLEXCAN_6 Peripheral Control Register */
#define MC_ME_PCTL77         MC_ME.PCTL[77].R              /* FLEXCAN_7 Peripheral Control Register */
#define MC_ME_PCTL78         MC_ME.PCTL[78].R              /*  */
#define MC_ME_PCTL79         MC_ME.PCTL[79].R              /*  */
#define MC_ME_PCTL80         MC_ME.PCTL[80].R              /*  */
#define MC_ME_PCTL81         MC_ME.PCTL[81].R              /* TDM Control Register */
#define MC_ME_PCTL82         MC_ME.PCTL[82].R              /* JDC Control Register */
#define MC_ME_PCTL83         MC_ME.PCTL[83].R              /* MEMU_0 Control Register */
#define MC_ME_PCTL84         MC_ME.PCTL[84].R              /* CRC Control Register */
#define MC_ME_PCTL85         MC_ME.PCTL[85].R              /*  */
#define MC_ME_PCTL86         MC_ME.PCTL[86].R              /*  */
#define MC_ME_PCTL87         MC_ME.PCTL[87].R              /*  */
#define MC_ME_PCTL88         MC_ME.PCTL[88].R              /*  */
#define MC_ME_PCTL89         MC_ME.PCTL[89].R              /*  */
#define MC_ME_PCTL90         MC_ME.PCTL[90].R              /* DMAMUX Control Register */
#define MC_ME_PCTL91         MC_ME.PCTL[91].R              /* PIT_RTI_0 Control Register */
#define MC_ME_PCTL92         MC_ME.PCTL[92].R              /*  */
#define MC_ME_PCTL93         MC_ME.PCTL[93].R              /* WKPU Control Register */
#define MC_ME_PCTL94         MC_ME.PCTL[94].R              /*  */
#define MC_ME_PCTL95         MC_ME.PCTL[95].R              /*  */
#define MC_ME_PCTL96         MC_ME.PCTL[96].R              /* SPI0 Control Register */
#define MC_ME_PCTL97         MC_ME.PCTL[97].R              /* SPI1 Control Register */
#define MC_ME_PCTL98         MC_ME.PCTL[98].R              /* SPI2 Control Register */
#define MC_ME_PCTL99         MC_ME.PCTL[99].R              /* SPI3 Control Register */
#define MC_ME_PCTL100        MC_ME.PCTL[100].R             /* SPI4 Control Register */
#define MC_ME_PCTL101        MC_ME.PCTL[101].R             /* SPI5 Control Register */
#define MC_ME_PCTL102        MC_ME.PCTL[102].R             /* RTC-API Control Register */
#define MC_ME_PCTL103        MC_ME.PCTL[103].R             /*  */
#define MC_ME_CS             MC_ME.CS.R                    /* Core Status Register */
#define MC_ME_CCTL0          MC_ME.CCTL[0].R               /*  */
#define MC_ME_CCTL1          MC_ME.CCTL[1].R               /* Core1 Control Register */
#define MC_ME_CCTL2          MC_ME.CCTL[2].R               /* Core2 Control Register */
#define MC_ME_CCTL3          MC_ME.CCTL[3].R               /* Core3 Control Register */
#define MC_ME_CADDR0         MC_ME.CADDR[0].R              /*  */
#define MC_ME_CADDR1         MC_ME.CADDR[1].R              /* CORE1 Address Register */
#define MC_ME_CADDR2         MC_ME.CADDR[2].R              /* CORE2 Address Register */
#define MC_ME_CADDR3         MC_ME.CADDR[3].R              /* CORE3 Address Register */

/* MC_RGM */
#define MC_RGM_DES           MC_RGM.DES.R                  /* 'Destructive' Event Status Register */
#define MC_RGM_DERD          MC_RGM.DERD.R                 /* 'Destructive' Event Reset Disable Register */
#define MC_RGM_DBRE          MC_RGM.DBRE.R                 /* 'Destructive' Bidirectional Reset Enable Register */
#define MC_RGM_FES           MC_RGM.FES.R                  /* 'Functional' Event Status Register */
#define MC_RGM_FERD          MC_RGM.FERD.R                 /* 'Functional' Event Reset Disable Register */
#define MC_RGM_FEAR          MC_RGM.FEAR.R                 /* 'Functional' Event Reset DisableAlternate Request Status Register */
#define MC_RGM_FBRE          MC_RGM.FBRE.R                 /* 'Functional' Bidirectional Reset Enable Register */
#define MC_RGM_FESS          MC_RGM.FESS.R                 /* 'Functional' Event Short Sequence Register */
#define MC_RGM_FRET          MC_RGM.FRET.R                 /* 'Functional' Reset Escalation Threshold Register */
#define MC_RGM_DRET          MC_RGM.DRET.R                 /* 'Destructive' Reset Escalation Threshold Register */

/* MEMU_0 */
#define MEMU_0_CTRL          MEMU_0.CTRL.R                 /* Control register */
#define MEMU_0_ERR_FLAG      MEMU_0.ERR_FLAG.R             /* Error flag register */
#define MEMU_0_DEBUG         MEMU_0.DEBUG.R                /* Debug register */
#define MEMU_0_SYS_RAM_CERR_STS0 MEMU_0.SYS_RAM_CERR[0].STS.R /* System RAM correctable error reporting table status register */
#define MEMU_0_SYS_RAM_CERR_ADDR0 MEMU_0.SYS_RAM_CERR[0].ADDR.R /* System RAM correctable error reporting table address register */
#define MEMU_0_SYS_RAM_CERR_STS1 MEMU_0.SYS_RAM_CERR[1].STS.R /* System RAM correctable error reporting table status register */
#define MEMU_0_SYS_RAM_CERR_ADDR1 MEMU_0.SYS_RAM_CERR[1].ADDR.R /* System RAM correctable error reporting table address register */
#define MEMU_0_SYS_RAM_CERR_STS2 MEMU_0.SYS_RAM_CERR[2].STS.R /* System RAM correctable error reporting table status register */
#define MEMU_0_SYS_RAM_CERR_ADDR2 MEMU_0.SYS_RAM_CERR[2].ADDR.R /* System RAM correctable error reporting table address register */
#define MEMU_0_SYS_RAM_CERR_STS3 MEMU_0.SYS_RAM_CERR[3].STS.R /* System RAM correctable error reporting table status register */
#define MEMU_0_SYS_RAM_CERR_ADDR3 MEMU_0.SYS_RAM_CERR[3].ADDR.R /* System RAM correctable error reporting table address register */
#define MEMU_0_SYS_RAM_CERR_STS4 MEMU_0.SYS_RAM_CERR[4].STS.R /* System RAM correctable error reporting table status register */
#define MEMU_0_SYS_RAM_CERR_ADDR4 MEMU_0.SYS_RAM_CERR[4].ADDR.R /* System RAM correctable error reporting table address register */
#define MEMU_0_SYS_RAM_CERR_STS5 MEMU_0.SYS_RAM_CERR[5].STS.R /* System RAM correctable error reporting table status register */
#define MEMU_0_SYS_RAM_CERR_ADDR5 MEMU_0.SYS_RAM_CERR[5].ADDR.R /* System RAM correctable error reporting table address register */
#define MEMU_0_SYS_RAM_CERR_STS6 MEMU_0.SYS_RAM_CERR[6].STS.R /* System RAM correctable error reporting table status register */
#define MEMU_0_SYS_RAM_CERR_ADDR6 MEMU_0.SYS_RAM_CERR[6].ADDR.R /* System RAM correctable error reporting table address register */
#define MEMU_0_SYS_RAM_CERR_STS7 MEMU_0.SYS_RAM_CERR[7].STS.R /* System RAM correctable error reporting table status register */
#define MEMU_0_SYS_RAM_CERR_ADDR7 MEMU_0.SYS_RAM_CERR[7].ADDR.R /* System RAM correctable error reporting table address register */
#define MEMU_0_SYS_RAM_CERR_STS8 MEMU_0.SYS_RAM_CERR[8].STS.R /* System RAM correctable error reporting table status register */
#define MEMU_0_SYS_RAM_CERR_ADDR8 MEMU_0.SYS_RAM_CERR[8].ADDR.R /* System RAM correctable error reporting table address register */
#define MEMU_0_SYS_RAM_CERR_STS9 MEMU_0.SYS_RAM_CERR[9].STS.R /* System RAM correctable error reporting table status register */
#define MEMU_0_SYS_RAM_CERR_ADDR9 MEMU_0.SYS_RAM_CERR[9].ADDR.R /* System RAM correctable error reporting table address register */
#define MEMU_0_SYS_RAM_UNCERR_STS MEMU_0.SYS_RAM_UNCERR_STS.R /* System RAM uncorrectable error reporting table status register */
#define MEMU_0_SYS_RAM_UNCERR_ADDR MEMU_0.SYS_RAM_UNCERR_ADDR.R /* System RAM uncorrectable error reporting table address register */
#define MEMU_0_SYS_RAM_OFLW  MEMU_0.SYS_RAM_OFLW.R         /* System RAM concurrent overflow register */
#define MEMU_0_PERIPH_RAM_CERR_STS0  MEMU_0.PERIPH_RAM_CERR[0].STS.R        /* Peripheral RAM correctable error reporting table status register */
#define MEMU_0_PERIPH_RAM_CERR_ADDR0 MEMU_0.PERIPH_RAM_CERR[0].ADDR.R       /* Peripheral RAM correctable error reporting table address register */
#define MEMU_0_PERIPH_RAM_CERR_STS1  MEMU_0.PERIPH_RAM_CERR[1].STS.R        /* Peripheral RAM correctable error reporting table status register */
#define MEMU_0_PERIPH_RAM_CERR_ADDR1 MEMU_0.PERIPH_RAM_CERR[1].ADDR.R       /* Peripheral RAM correctable error reporting table address register */
#define MEMU_0_PERIPH_RAM_UNCERR_STS MEMU_0.PERIPH_RAM_UNCERR_STS.R /* Peripheral RAM uncorrectable error reporting table status register */
#define MEMU_0_PERIPH_RAM_UNCERR_ADDR MEMU_0.PERIPH_RAM_UNCERR_ADDR.R /* Peripheral RAM uncorrectable error reporting table address register */
#define MEMU_0_PERIPH_RAM_OFLW MEMU_0.PERIPH_RAM_OFLW.R  /* Peripheral RAM concurrent overflow register */
#define MEMU_0_FLASH_CERR_STS0 MEMU_0.FLASH_CERR[0].STS.R /* Flash correctable error reporting table status register */
#define MEMU_0_FLASH_CERR_ADDR0 MEMU_0.FLASH_CERR[0].ADDR.R /* Flash correctable error reporting table address register */
#define MEMU_0_FLASH_CERR_STS1 MEMU_0.FLASH_CERR[1].STS.R /* Flash correctable error reporting table status register */
#define MEMU_0_FLASH_CERR_ADDR1 MEMU_0.FLASH_CERR[1].ADDR.R /* Flash correctable error reporting table address register */
#define MEMU_0_FLASH_CERR_STS2 MEMU_0.FLASH_CERR[2].STS.R /* Flash correctable error reporting table status register */
#define MEMU_0_FLASH_CERR_ADDR2 MEMU_0.FLASH_CERR[2].ADDR.R /* Flash correctable error reporting table address register */
#define MEMU_0_FLASH_CERR_STS3 MEMU_0.FLASH_CERR[3].STS.R /* Flash correctable error reporting table status register */
#define MEMU_0_FLASH_CERR_ADDR3 MEMU_0.FLASH_CERR[3].ADDR.R /* Flash correctable error reporting table address register */
#define MEMU_0_FLASH_CERR_STS4 MEMU_0.FLASH_CERR[4].STS.R /* Flash correctable error reporting table status register */
#define MEMU_0_FLASH_CERR_ADDR4 MEMU_0.FLASH_CERR[4].ADDR.R /* Flash correctable error reporting table address register */
#define MEMU_0_FLASH_CERR_STS5 MEMU_0.FLASH_CERR[5].STS.R /* Flash correctable error reporting table status register */
#define MEMU_0_FLASH_CERR_ADDR5 MEMU_0.FLASH_CERR[5].ADDR.R /* Flash correctable error reporting table address register */
#define MEMU_0_FLASH_CERR_STS6 MEMU_0.FLASH_CERR[6].STS.R /* Flash correctable error reporting table status register */
#define MEMU_0_FLASH_CERR_ADDR6 MEMU_0.FLASH_CERR[6].ADDR.R /* Flash correctable error reporting table address register */
#define MEMU_0_FLASH_CERR_STS7 MEMU_0.FLASH_CERR[7].STS.R /* Flash correctable error reporting table status register */
#define MEMU_0_FLASH_CERR_ADDR7 MEMU_0.FLASH_CERR[7].ADDR.R /* Flash correctable error reporting table address register */
#define MEMU_0_FLASH_CERR_STS8 MEMU_0.FLASH_CERR[8].STS.R /* Flash correctable error reporting table status register */
#define MEMU_0_FLASH_CERR_ADDR8 MEMU_0.FLASH_CERR[8].ADDR.R /* Flash correctable error reporting table address register */
#define MEMU_0_FLASH_CERR_STS9 MEMU_0.FLASH_CERR[9].STS.R /* Flash correctable error reporting table status register */
#define MEMU_0_FLASH_CERR_ADDR9 MEMU_0.FLASH_CERR[9].ADDR.R /* Flash correctable error reporting table address register */
#define MEMU_0_FLASH_CERR_STS10 MEMU_0.FLASH_CERR[10].STS.R /* Flash correctable error reporting table status register */
#define MEMU_0_FLASH_CERR_ADDR10 MEMU_0.FLASH_CERR[10].ADDR.R /* Flash correctable error reporting table address register */
#define MEMU_0_FLASH_CERR_STS11 MEMU_0.FLASH_CERR[11].STS.R /* Flash correctable error reporting table status register */
#define MEMU_0_FLASH_CERR_ADDR11 MEMU_0.FLASH_CERR[11].ADDR.R /* Flash correctable error reporting table address register */
#define MEMU_0_FLASH_CERR_STS12 MEMU_0.FLASH_CERR[12].STS.R /* Flash correctable error reporting table status register */
#define MEMU_0_FLASH_CERR_ADDR12 MEMU_0.FLASH_CERR[12].ADDR.R /* Flash correctable error reporting table address register */
#define MEMU_0_FLASH_CERR_STS13 MEMU_0.FLASH_CERR[13].STS.R /* Flash correctable error reporting table status register */
#define MEMU_0_FLASH_CERR_ADDR13 MEMU_0.FLASH_CERR[13].ADDR.R /* Flash correctable error reporting table address register */
#define MEMU_0_FLASH_CERR_STS14 MEMU_0.FLASH_CERR[14].STS.R /* Flash correctable error reporting table status register */
#define MEMU_0_FLASH_CERR_ADDR14 MEMU_0.FLASH_CERR[14].ADDR.R /* Flash correctable error reporting table address register */
#define MEMU_0_FLASH_CERR_STS15 MEMU_0.FLASH_CERR[15].STS.R /* Flash correctable error reporting table status register */
#define MEMU_0_FLASH_CERR_ADDR15 MEMU_0.FLASH_CERR[15].ADDR.R /* Flash correctable error reporting table address register */
#define MEMU_0_FLASH_CERR_STS16 MEMU_0.FLASH_CERR[16].STS.R /* Flash correctable error reporting table status register */
#define MEMU_0_FLASH_CERR_ADDR16 MEMU_0.FLASH_CERR[16].ADDR.R /* Flash correctable error reporting table address register */
#define MEMU_0_FLASH_CERR_STS17 MEMU_0.FLASH_CERR[17].STS.R /* Flash correctable error reporting table status register */
#define MEMU_0_FLASH_CERR_ADDR17 MEMU_0.FLASH_CERR[17].ADDR.R /* Flash correctable error reporting table address register */
#define MEMU_0_FLASH_CERR_STS18 MEMU_0.FLASH_CERR[18].STS.R /* Flash correctable error reporting table status register */
#define MEMU_0_FLASH_CERR_ADDR18 MEMU_0.FLASH_CERR[18].ADDR.R /* Flash correctable error reporting table address register */
#define MEMU_0_FLASH_CERR_STS19 MEMU_0.FLASH_CERR[19].STS.R /* Flash correctable error reporting table status register */
#define MEMU_0_FLASH_CERR_ADDR19 MEMU_0.FLASH_CERR[19].ADDR.R /* Flash correctable error reporting table address register */
#define MEMU_0_FLASH_UNCERR_STS MEMU_0.FLASH_UNCERR_STS.R /* Flash uncorrectable error reporting table status register */
#define MEMU_0_FLASH_UNCERR_ADDR MEMU_0.FLASH_UNCERR_ADDR.R /* Flash uncorrectable error reporting table address register */
#define MEMU_0_FLASH_OFLW        MEMU_0.FLASH_OFLW.R         /* Flash concurrent overflow register */

