kbecker0619/StateMachineEngine/components/cwsw_arch_prj/cwsw_arch/MPC57xx/include/MPC5748G_defines_3.h
/* MEMU_1 */
#define MEMU_1_CTRL          MEMU_1.CTRL.R                 /* Control register */
#define MEMU_1_ERR_FLAG      MEMU_1.ERR_FLAG.R             /* Error flag register */
#define MEMU_1_DEBUG         MEMU_1.DEBUG.R                /* Debug register */
#define MEMU_1_SYS_RAM_CERR_STS0 MEMU_1.SYS_RAM_CERR[0].STS.R /* System RAM correctable error reporting table status register */
#define MEMU_1_SYS_RAM_CERR_ADDR0 MEMU_1.SYS_RAM_CERR[0].ADDR.R /* System RAM correctable error reporting table address register */
#define MEMU_1_SYS_RAM_CERR_STS1 MEMU_1.SYS_RAM_CERR[1].STS.R /* System RAM correctable error reporting table status register */
#define MEMU_1_SYS_RAM_CERR_ADDR1 MEMU_1.SYS_RAM_CERR[1].ADDR.R /* System RAM correctable error reporting table address register */
#define MEMU_1_SYS_RAM_CERR_STS2 MEMU_1.SYS_RAM_CERR[2].STS.R /* System RAM correctable error reporting table status register */
#define MEMU_1_SYS_RAM_CERR_ADDR2 MEMU_1.SYS_RAM_CERR[2].ADDR.R /* System RAM correctable error reporting table address register */
#define MEMU_1_SYS_RAM_UNCERR_STS MEMU_1.SYS_RAM_UNCERR_STS.R /* System RAM uncorrectable error reporting table status register */
#define MEMU_1_SYS_RAM_UNCERR_ADDR MEMU_1.SYS_RAM_UNCERR_ADDR.R /* System RAM uncorrectable error reporting table address register */
#define MEMU_1_SYS_RAM_OFLW  MEMU_1.SYS_RAM_OFLW.R         /* System RAM concurrent overflow register */
#define MEMU_1_PERIPH_RAM_CERR_STS0  MEMU_1.PERIPH_RAM_CERR[0].STS.R        /* Peripheral RAM correctable error reporting table status register */
#define MEMU_1_PERIPH_RAM_CERR_ADDR0 MEMU_1.PERIPH_RAM_CERR[0].ADDR.R       /* Peripheral RAM correctable error reporting table address register */
#define MEMU_1_PERIPH_RAM_UNCERR_STS MEMU_1.PERIPH_RAM_UNCERR_STS.R /* Peripheral RAM uncorrectable error reporting table status register */
#define MEMU_1_PERIPH_RAM_UNCERR_ADDR MEMU_1.PERIPH_RAM_UNCERR_ADDR.R /* Peripheral RAM uncorrectable error reporting table address register */
#define MEMU_1_PERIPH_RAM_OFLW MEMU_1.PERIPH_RAM_OFLW.R  /* Peripheral RAM concurrent overflow register */

/* MLB */
#define MLB_C0               MLB.C0.R                      /* MediaLB Control 0 Register */
#define MLB_MS0              MLB.MS0.R                     /* MediaLB Channel Status 0 Register */
#define MLB_MS1              MLB.MS1.R                     /* MediaLB Channel Status1 Register */
#define MLB_MSS              MLB.MSS.R                     /* MediaLB System Status Register */
#define MLB_MSD              MLB.MSD.R                     /* MediaLB System Data Register */
#define MLB_MIEN             MLB.MIEN.R                    /* MediaLB Interrupt Enable Register */
#define MLB_C1               MLB.C1.R                      /* MediaLB Control 1 Register */
#define MLB_HCTL             MLB.HCTL.R                    /* HBI Control Register */
#define MLB_HCMR0            MLB.HCMR0.R                   /* HBI Channel Mask 0 Register */
#define MLB_HCMR1            MLB.HCMR1.R                   /* HBI Channel Mask 1 Register */
#define MLB_HCER0            MLB.HCER0.R                   /* HBI Channel Error 0 Register */
#define MLB_HCER1            MLB.HCER1.R                   /* HBI Channel Error 1 Register */
#define MLB_HCBR0            MLB.HCBR0.R                   /* HBI Channel Busy 0 Register */
#define MLB_HCBR1            MLB.HCBR1.R                   /* HBI Channel Busy 1 Register */
#define MLB_MDAT0            MLB.MDAT0.R                   /* MIF Data 0 Register */
#define MLB_MDAT1            MLB.MDAT1.R                   /* MIF Data 1 Register */
#define MLB_MDAT2            MLB.MDAT2.R                   /* MIF Data 2 Register */
#define MLB_MDAT3            MLB.MDAT3.R                   /* MIF Data 3 Register */
#define MLB_MDWE0            MLB.MDWE0.R                   /* MIF Data Write Enable 0 Register */
#define MLB_MDWE1            MLB.MDWE1.R                   /* MIF Data Write Enable 1 Register */
#define MLB_MDWE2            MLB.MDWE2.R                   /* MIF Data Write Enable 2 Register */
#define MLB_MDWE3            MLB.MDWE3.R                   /* MIF Data Write Enable 3 Register */
#define MLB_MCTL             MLB.MCTL.R                    /* MIF Control Register */
#define MLB_MADR             MLB.MADR.R                    /* MIF Address Register */
#define MLB_ACTL             MLB.ACTL.R                    /* AHB Control Register */
#define MLB_ACSR0            MLB.ACSR0.R                   /* AHB Channel Status 0 Register */
#define MLB_ACSR1            MLB.ACSR1.R                   /* AHB Channel Status 1 Register */
#define MLB_ACMR0            MLB.ACMR0.R                   /* AHB Channel Mask 0 Register */
#define MLB_ACMR1            MLB.ACMR1.R                   /* AHB Channel Mask 1 Register */

/* PASS */
#define PASS_LCSTAT          PASS.LCSTAT.R                 /* Life Cycle Status Register */
#define PASS_CHSEL           PASS.CHSEL.R                  /* Challenge Selector Register */
#define PASS_CSTAT           PASS.CSTAT.R                  /* Challenge Status Register */
#define PASS_CIN0            PASS.CIN[0].R                 /* Challenge Input Register */
#define PASS_CIN1            PASS.CIN[1].R                 /* Challenge Input Register */
#define PASS_CIN2            PASS.CIN[2].R                 /* Challenge Input Register */
#define PASS_CIN3            PASS.CIN[3].R                 /* Challenge Input Register */
#define PASS_CIN4            PASS.CIN[4].R                 /* Challenge Input Register */
#define PASS_CIN5            PASS.CIN[5].R                 /* Challenge Input Register */
#define PASS_CIN6            PASS.CIN[6].R                 /* Challenge Input Register */
#define PASS_CIN7            PASS.CIN[7].R                 /* Challenge Input Register */
#define PASS_LOCK0_PG0       PASS.PG[0].LOCK0.R            /* Password Group n - Lock 0 Status Register */
#define PASS_LOCK1_PG0       PASS.PG[0].LOCK1.R            /* Password Group n - Lock 1 Status Register */
#define PASS_LOCK2_PG0       PASS.PG[0].LOCK2.R            /* Password Group n - Lock 2 Status Register */
#define PASS_LOCK3_PG0       PASS.PG[0].LOCK3.R            /* Password Group n - Lock 3 Status Register */
#define PASS_LOCK0_PG1       PASS.PG[1].LOCK0.R            /* Password Group n - Lock 0 Status Register */
#define PASS_LOCK1_PG1       PASS.PG[1].LOCK1.R            /* Password Group n - Lock 1 Status Register */
#define PASS_LOCK2_PG1       PASS.PG[1].LOCK2.R            /* Password Group n - Lock 2 Status Register */
#define PASS_LOCK3_PG1       PASS.PG[1].LOCK3.R            /* Password Group n - Lock 3 Status Register */
#define PASS_LOCK0_PG2       PASS.PG[2].LOCK0.R            /* Password Group n - Lock 0 Status Register */
#define PASS_LOCK1_PG2       PASS.PG[2].LOCK1.R            /* Password Group n - Lock 1 Status Register */
#define PASS_LOCK2_PG2       PASS.PG[2].LOCK2.R            /* Password Group n - Lock 2 Status Register */
#define PASS_LOCK3_PG2       PASS.PG[2].LOCK3.R            /* Password Group n - Lock 3 Status Register */
#define PASS_LOCK0_PG3       PASS.PG[3].LOCK0.R            /* Password Group n - Lock 0 Status Register */
#define PASS_LOCK1_PG3       PASS.PG[3].LOCK1.R            /* Password Group n - Lock 1 Status Register */
#define PASS_LOCK2_PG3       PASS.PG[3].LOCK2.R            /* Password Group n - Lock 2 Status Register */
#define PASS_LOCK3_PG3       PASS.PG[3].LOCK3.R            /* Password Group n - Lock 3 Status Register */

/* PCM */
#define PCM_IAHB_BE0         PCM.IAHB_BE0.R                /* Bus Bridge Configuration Register 0 */
#define PCM_IAHB_BE1         PCM.IAHB_BE1.R                /* Bus Bridge Configuration Register 0 */
#define PCM_IAHB_BE2         PCM.IAHB_BE2.R                /* Bus Bridge Configuration Register 0 */
#define PCM_IAHB_BE3         PCM.IAHB_BE3.R                /* Bus Bridge Configuration Register 3 */
#define PCM_IPS_CGM_EN0      PCM.IPS_CGM_EN0.R             /* IPS Clock Gating Module Enable 0 Register */
#define PCM_IPS_CGM_EN1      PCM.IPS_CGM_EN1.R             /* IPS Clock Gating Enable 1 Register */

/* PFLASH */
#define PFLASH_PFCR1         PFLASH.PFCR1.R                /* Platform Flash Configuration Register 1 */
#define PFLASH_PFCR2         PFLASH.PFCR2.R                /* Platform Flash Configuration Register 2 */
#define PFLASH_PFCR3         PFLASH.PFCR3.R                /* Platform Flash Configuration Register 3 */
#define PFLASH_PFAPR         PFLASH.PFAPR.R                /* Platform Flash Access Protection Register */
#define PFLASH_PFCRCR        PFLASH.PFCRCR.R               /* Platform Flash Remap Control Register */
#define PFLASH_PFCRDE        PFLASH.PFCRDE.R               /* Platform Flash Remap Descriptor Enable Register */
#define PFLASH_PFCR4         PFLASH.PFCR4.R                /* Platform Flash Configuration Register 4 */
#define PFLASH_PFCRD0_Word0  PFLASH.PFCRD[0].Word0.R       /* Platform Flash Calibration Region Descriptor n Word0 */
#define PFLASH_PFCRD0_Word1  PFLASH.PFCRD[0].Word1.R       /* Platform Flash Calibration Region Descriptor n Word1 */
#define PFLASH_PFCRD0_Word2  PFLASH.PFCRD[0].Word2.R       /* Platform Flash Calibration Region Descriptor n Word2 */
#define PFLASH_PFCRD1_Word0  PFLASH.PFCRD[1].Word0.R       /* Platform Flash Calibration Region Descriptor n Word0 */
#define PFLASH_PFCRD1_Word1  PFLASH.PFCRD[1].Word1.R       /* Platform Flash Calibration Region Descriptor n Word1 */
#define PFLASH_PFCRD1_Word2  PFLASH.PFCRD[1].Word2.R       /* Platform Flash Calibration Region Descriptor n Word2 */
#define PFLASH_PFCRD2_Word0  PFLASH.PFCRD[2].Word0.R       /* Platform Flash Calibration Region Descriptor n Word0 */
#define PFLASH_PFCRD2_Word1  PFLASH.PFCRD[2].Word1.R       /* Platform Flash Calibration Region Descriptor n Word1 */
#define PFLASH_PFCRD2_Word2  PFLASH.PFCRD[2].Word2.R       /* Platform Flash Calibration Region Descriptor n Word2 */
#define PFLASH_PFCRD3_Word0  PFLASH.PFCRD[3].Word0.R       /* Platform Flash Calibration Region Descriptor n Word0 */
#define PFLASH_PFCRD3_Word1  PFLASH.PFCRD[3].Word1.R       /* Platform Flash Calibration Region Descriptor n Word1 */
#define PFLASH_PFCRD3_Word2  PFLASH.PFCRD[3].Word2.R       /* Platform Flash Calibration Region Descriptor n Word2 */
#define PFLASH_PFCRD4_Word0  PFLASH.PFCRD[4].Word0.R       /* Platform Flash Calibration Region Descriptor n Word0 */
#define PFLASH_PFCRD4_Word1  PFLASH.PFCRD[4].Word1.R       /* Platform Flash Calibration Region Descriptor n Word1 */
#define PFLASH_PFCRD4_Word2  PFLASH.PFCRD[4].Word2.R       /* Platform Flash Calibration Region Descriptor n Word2 */
#define PFLASH_PFCRD5_Word0  PFLASH.PFCRD[5].Word0.R       /* Platform Flash Calibration Region Descriptor n Word0 */
#define PFLASH_PFCRD5_Word1  PFLASH.PFCRD[5].Word1.R       /* Platform Flash Calibration Region Descriptor n Word1 */
#define PFLASH_PFCRD5_Word2  PFLASH.PFCRD[5].Word2.R       /* Platform Flash Calibration Region Descriptor n Word2 */
#define PFLASH_PFCRD6_Word0  PFLASH.PFCRD[6].Word0.R       /* Platform Flash Calibration Region Descriptor n Word0 */
#define PFLASH_PFCRD6_Word1  PFLASH.PFCRD[6].Word1.R       /* Platform Flash Calibration Region Descriptor n Word1 */
#define PFLASH_PFCRD6_Word2  PFLASH.PFCRD[6].Word2.R       /* Platform Flash Calibration Region Descriptor n Word2 */
#define PFLASH_PFCRD7_Word0  PFLASH.PFCRD[7].Word0.R       /* Platform Flash Calibration Region Descriptor n Word0 */
#define PFLASH_PFCRD7_Word1  PFLASH.PFCRD[7].Word1.R       /* Platform Flash Calibration Region Descriptor n Word1 */
#define PFLASH_PFCRD7_Word2  PFLASH.PFCRD[7].Word2.R       /* Platform Flash Calibration Region Descriptor n Word2 */

/* PIT */
#define PIT_MCR              PIT.MCR.R                     /* PIT Module Control Register */
#define PIT_RTI_LDVAL        PIT.RTI_LDVAL.R               /* Timer Load Value Register */
#define PIT_RTI_CVAL         PIT.RTI_CVAL.R                /* Current Timer Value Register */
#define PIT_RTI_TCTRL        PIT.RTI_TCTRL.R               /* Timer Control Register */
#define PIT_RTI_TFLG         PIT.RTI_TFLG.R                /* Timer Flag Register */
#define PIT_LDVAL0           PIT.TIMER[0].LDVAL.R          /* Timer Load Value Register */
#define PIT_CVAL0            PIT.TIMER[0].CVAL.R           /* Current Timer Value Register */
#define PIT_TCTRL0           PIT.TIMER[0].TCTRL.R          /* Timer Control Register */
#define PIT_TFLG0            PIT.TIMER[0].TFLG.R           /* Timer Flag Register */
#define PIT_LDVAL1           PIT.TIMER[1].LDVAL.R          /* Timer Load Value Register */
#define PIT_CVAL1            PIT.TIMER[1].CVAL.R           /* Current Timer Value Register */
#define PIT_TCTRL1           PIT.TIMER[1].TCTRL.R          /* Timer Control Register */
#define PIT_TFLG1            PIT.TIMER[1].TFLG.R           /* Timer Flag Register */
#define PIT_LDVAL2           PIT.TIMER[2].LDVAL.R          /* Timer Load Value Register */
#define PIT_CVAL2            PIT.TIMER[2].CVAL.R           /* Current Timer Value Register */
#define PIT_TCTRL2           PIT.TIMER[2].TCTRL.R          /* Timer Control Register */
#define PIT_TFLG2            PIT.TIMER[2].TFLG.R           /* Timer Flag Register */
#define PIT_LDVAL3           PIT.TIMER[3].LDVAL.R          /* Timer Load Value Register */
#define PIT_CVAL3            PIT.TIMER[3].CVAL.R           /* Current Timer Value Register */
#define PIT_TCTRL3           PIT.TIMER[3].TCTRL.R          /* Timer Control Register */
#define PIT_TFLG3            PIT.TIMER[3].TFLG.R           /* Timer Flag Register */
#define PIT_LDVAL4           PIT.TIMER[4].LDVAL.R          /* Timer Load Value Register */
#define PIT_CVAL4            PIT.TIMER[4].CVAL.R           /* Current Timer Value Register */
#define PIT_TCTRL4           PIT.TIMER[4].TCTRL.R          /* Timer Control Register */
#define PIT_TFLG4            PIT.TIMER[4].TFLG.R           /* Timer Flag Register */
#define PIT_LDVAL5           PIT.TIMER[5].LDVAL.R          /* Timer Load Value Register */
#define PIT_CVAL5            PIT.TIMER[5].CVAL.R           /* Current Timer Value Register */
#define PIT_TCTRL5           PIT.TIMER[5].TCTRL.R          /* Timer Control Register */
#define PIT_TFLG5            PIT.TIMER[5].TFLG.R           /* Timer Flag Register */
#define PIT_LDVAL6           PIT.TIMER[6].LDVAL.R          /* Timer Load Value Register */
#define PIT_CVAL6            PIT.TIMER[6].CVAL.R           /* Current Timer Value Register */
#define PIT_TCTRL6           PIT.TIMER[6].TCTRL.R          /* Timer Control Register */
#define PIT_TFLG6            PIT.TIMER[6].TFLG.R           /* Timer Flag Register */
#define PIT_LDVAL7           PIT.TIMER[7].LDVAL.R          /* Timer Load Value Register */
#define PIT_CVAL7            PIT.TIMER[7].CVAL.R           /* Current Timer Value Register */
#define PIT_TCTRL7           PIT.TIMER[7].TCTRL.R          /* Timer Control Register */
#define PIT_TFLG7            PIT.TIMER[7].TFLG.R           /* Timer Flag Register */
#define PIT_LDVAL8           PIT.TIMER[8].LDVAL.R          /* Timer Load Value Register */
#define PIT_CVAL8            PIT.TIMER[8].CVAL.R           /* Current Timer Value Register */
#define PIT_TCTRL8           PIT.TIMER[8].TCTRL.R          /* Timer Control Register */
#define PIT_TFLG8            PIT.TIMER[8].TFLG.R           /* Timer Flag Register */
#define PIT_LDVAL9           PIT.TIMER[9].LDVAL.R          /* Timer Load Value Register */
#define PIT_CVAL9            PIT.TIMER[9].CVAL.R           /* Current Timer Value Register */
#define PIT_TCTRL9           PIT.TIMER[9].TCTRL.R          /* Timer Control Register */
#define PIT_TFLG9            PIT.TIMER[9].TFLG.R           /* Timer Flag Register */
#define PIT_LDVAL10          PIT.TIMER[10].LDVAL.R         /* Timer Load Value Register */
#define PIT_CVAL10           PIT.TIMER[10].CVAL.R          /* Current Timer Value Register */
#define PIT_TCTRL10          PIT.TIMER[10].TCTRL.R         /* Timer Control Register */
#define PIT_TFLG10           PIT.TIMER[10].TFLG.R          /* Timer Flag Register */
#define PIT_LDVAL11          PIT.TIMER[11].LDVAL.R         /* Timer Load Value Register */
#define PIT_CVAL11           PIT.TIMER[11].CVAL.R          /* Current Timer Value Register */
#define PIT_TCTRL11          PIT.TIMER[11].TCTRL.R         /* Timer Control Register */
#define PIT_TFLG11           PIT.TIMER[11].TFLG.R          /* Timer Flag Register */
#define PIT_LDVAL12          PIT.TIMER[12].LDVAL.R         /* Timer Load Value Register */
#define PIT_CVAL12           PIT.TIMER[12].CVAL.R          /* Current Timer Value Register */
#define PIT_TCTRL12          PIT.TIMER[12].TCTRL.R         /* Timer Control Register */
#define PIT_TFLG12           PIT.TIMER[12].TFLG.R          /* Timer Flag Register */
#define PIT_LDVAL13          PIT.TIMER[13].LDVAL.R         /* Timer Load Value Register */
#define PIT_CVAL13           PIT.TIMER[13].CVAL.R          /* Current Timer Value Register */
#define PIT_TCTRL13          PIT.TIMER[13].TCTRL.R         /* Timer Control Register */
#define PIT_TFLG13           PIT.TIMER[13].TFLG.R          /* Timer Flag Register */
#define PIT_LDVAL14          PIT.TIMER[14].LDVAL.R         /* Timer Load Value Register */
#define PIT_CVAL14           PIT.TIMER[14].CVAL.R          /* Current Timer Value Register */
#define PIT_TCTRL14          PIT.TIMER[14].TCTRL.R         /* Timer Control Register */
#define PIT_TFLG14           PIT.TIMER[14].TFLG.R          /* Timer Flag Register */
#define PIT_LDVAL15          PIT.TIMER[15].LDVAL.R         /* Timer Load Value Register */
#define PIT_CVAL15           PIT.TIMER[15].CVAL.R          /* Current Timer Value Register */
#define PIT_TCTRL15          PIT.TIMER[15].TCTRL.R         /* Timer Control Register */
#define PIT_TFLG15           PIT.TIMER[15].TFLG.R          /* Timer Flag Register */

/* PLLDIG */
#define PLLDIG_PLLCAL3       PLLDIG.PLLCAL3.R              /* PLLDIG PLL Calibration 3 Register */
#define PLLDIG_PLLCR         PLLDIG.PLLCR.R                /* PLLDIG PLL Control Register */
#define PLLDIG_PLLSR         PLLDIG.PLLSR.R                /* PLLDIG PLL Status Register */
#define PLLDIG_PLLDV         PLLDIG.PLLDV.R                /* PLLDIG PLL Divider Register */
#define PLLDIG_PLLFM         PLLDIG.PLLFM.R                /* PLLDIG PLL Frequency Modulation Register */
#define PLLDIG_PLLFD         PLLDIG.PLLFD.R                /* PLLDIG PLL Fractional Divide Register */

